<a href="https://colab.research.google.com/github/npgeorge/DS-Unit-2-Linear-Models/blob/master/Nicholas_George_Assignment_3%2C_Regression_Classification.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 2, Sprint 1, Module 3*

---

# Ridge Regression

## Assignment

We're going back to our other **New York City** real estate dataset. Instead of predicting apartment rents, you'll predict property sales prices.

But not just for condos in Tribeca...

Instead, predict property sales prices for **One Family Dwellings** (`BUILDING_CLASS_CATEGORY` == `'01 ONE FAMILY DWELLINGS'`). 

Use a subset of the data where the **sale price was more than \\$100 thousand and less than $2 million.** 

The [NYC Department of Finance](https://www1.nyc.gov/site/finance/taxes/property-rolling-sales-data.page) has a glossary of property sales terms and NYC Building Class Code Descriptions. The data comes from the [NYC OpenData](https://data.cityofnewyork.us/browse?q=NYC%20calendar%20sales) portal.

- [ ] Do train/test split. Use data from January â€”Â March 2019 to train. Use data from April 2019 to test.
- [ ] Do one-hot encoding of categorical features.
- [ ] Do feature selection with `SelectKBest`.
- [ ] Do [feature scaling](https://scikit-learn.org/stable/modules/preprocessing.html).
- [ ] Fit a ridge regression model with multiple features.
- [ ] Get mean absolute error for the test set.
- [ ] As always, commit your notebook to your fork of the GitHub repo.


## Stretch Goals
- [ ] Add your own stretch goal(s) !
- [ ] Instead of `Ridge`, try `LinearRegression`. Depending on how many features you select, your errors will probably blow up! ðŸ’¥
- [ ] Instead of `Ridge`, try [`RidgeCV`](https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.RidgeCV.html).
- [ ] Learn more about feature selection:
    - ["Permutation importance"](https://www.kaggle.com/dansbecker/permutation-importance)
    - [scikit-learn's User Guide for Feature Selection](https://scikit-learn.org/stable/modules/feature_selection.html)
    - [mlxtend](http://rasbt.github.io/mlxtend/) library
    - scikit-learn-contrib libraries: [boruta_py](https://github.com/scikit-learn-contrib/boruta_py) & [stability-selection](https://github.com/scikit-learn-contrib/stability-selection)
    - [_Feature Engineering and Selection_](http://www.feat.engineering/) by Kuhn & Johnson.
- [ ] Try [statsmodels](https://www.statsmodels.org/stable/index.html) if youâ€™re interested in more inferential statistical approach to linear regression and feature selection, looking at p values and 95% confidence intervals for the coefficients.
- [ ] Read [_An Introduction to Statistical Learning_](http://faculty.marshall.usc.edu/gareth-james/ISL/ISLR%20Seventh%20Printing.pdf), Chapters 1-3, for more math & theory, but in an accessible, readable way.
- [ ] Try [scikit-learn pipelines](https://scikit-learn.org/stable/modules/compose.html).

In [0]:
%%capture
import sys

# If you're on Colab:
if 'google.colab' in sys.modules:
    DATA_PATH = 'https://raw.githubusercontent.com/LambdaSchool/DS-Unit-2-Applied-Modeling/master/data/'
    !pip install category_encoders==2.*

# If you're working locally:
else:
    DATA_PATH = '../data/'
    
# Ignore this Numpy warning when using Plotly Express:
# FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
import warnings
warnings.filterwarnings(action='ignore', category=FutureWarning, module='numpy')

In [0]:
import pandas as pd
import pandas_profiling

# Read New York City property sales data
df = pd.read_csv(DATA_PATH+'condos/NYC_Citywide_Rolling_Calendar_Sales.csv')

# Change column names: replace spaces with underscores
df.columns = [col.replace(' ', '_') for col in df]

# SALE_PRICE was read as strings.
# Remove symbols, convert to integer
df['SALE_PRICE'] = (
    df['SALE_PRICE']
    .str.replace('$','')
    .str.replace('-','')
    .str.replace(',','')
    .astype(int)
)

In [0]:
# BOROUGH is a numeric column, but arguably should be a categorical feature,
# so convert it from a number to a string
df['BOROUGH'] = df['BOROUGH'].astype(str)

In [0]:
# Reduce cardinality for NEIGHBORHOOD feature

# Get a list of the top 10 neighborhoods
top10 = df['NEIGHBORHOOD'].value_counts()[:10].index

# At locations where the neighborhood is NOT in the top 10, 
# replace the neighborhood with 'OTHER'
df.loc[~df['NEIGHBORHOOD'].isin(top10), 'NEIGHBORHOOD'] = 'OTHER'

In [291]:
top10

Index(['FLUSHING-NORTH', 'UPPER EAST SIDE (59-79)', 'UPPER EAST SIDE (79-96)',
       'BEDFORD STUYVESANT', 'BOROUGH PARK', 'UPPER WEST SIDE (59-79)',
       'GRAMERCY', 'ASTORIA', 'FOREST HILLS', 'EAST NEW YORK'],
      dtype='object')

In [292]:
df.tail(5)

      BOROUGH NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
23035       4        OTHER  ...     510000  04/30/2019
23036       4        OTHER  ...     355000  04/30/2019
23037       4        OTHER  ...     375000  04/30/2019
23038       4        OTHER  ...    1100000  04/30/2019
23039       4        OTHER  ...     569202  04/30/2019

[5 rows x 21 columns]

In [293]:
df.shape

(23040, 21)

In [0]:
#making data frame one family dwellings
df = df[df['BUILDING_CLASS_CATEGORY'] == '01 ONE FAMILY DWELLINGS']

In [295]:
df.shape

(5061, 21)

In [296]:
#passing a condition on the sale price into the data frame
condition = (df['SALE_PRICE'] >= 100000) & (df['SALE_PRICE'] <= 2000000)
df = df[condition]
df

      BOROUGH NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
44          3        OTHER  ...     550000  01/01/2019
61          4        OTHER  ...     200000  01/01/2019
78          2        OTHER  ...     810000  01/02/2019
108         3        OTHER  ...     125000  01/02/2019
111         3        OTHER  ...     620000  01/02/2019
...       ...          ...  ...        ...         ...
23029       4        OTHER  ...     635000  04/30/2019
23031       4        OTHER  ...     514000  04/30/2019
23032       4        OTHER  ...     635000  04/30/2019
23033       4        OTHER  ...     545000  04/30/2019
23035       4        OTHER  ...     510000  04/30/2019

[3164 rows x 21 columns]

In [297]:
df.dtypes

BOROUGH                            object
NEIGHBORHOOD                       object
BUILDING_CLASS_CATEGORY            object
TAX_CLASS_AT_PRESENT               object
BLOCK                               int64
LOT                                 int64
EASE-MENT                         float64
BUILDING_CLASS_AT_PRESENT          object
ADDRESS                            object
APARTMENT_NUMBER                   object
ZIP_CODE                          float64
RESIDENTIAL_UNITS                 float64
COMMERCIAL_UNITS                  float64
TOTAL_UNITS                       float64
LAND_SQUARE_FEET                   object
GROSS_SQUARE_FEET                 float64
YEAR_BUILT                        float64
TAX_CLASS_AT_TIME_OF_SALE           int64
BUILDING_CLASS_AT_TIME_OF_SALE     object
SALE_PRICE                          int64
SALE_DATE                          object
dtype: object

In [0]:
#fix square footage to reduce cardinality
#cleaning up "," for ease of use
df['LAND_SQUARE_FEET'] = (
    df['LAND_SQUARE_FEET']
    .str.replace(',','')
    .astype(int)
)

#try grouping them into four sub groups

In [299]:
df.dtypes #land square feet is now an integer

BOROUGH                            object
NEIGHBORHOOD                       object
BUILDING_CLASS_CATEGORY            object
TAX_CLASS_AT_PRESENT               object
BLOCK                               int64
LOT                                 int64
EASE-MENT                         float64
BUILDING_CLASS_AT_PRESENT          object
ADDRESS                            object
APARTMENT_NUMBER                   object
ZIP_CODE                          float64
RESIDENTIAL_UNITS                 float64
COMMERCIAL_UNITS                  float64
TOTAL_UNITS                       float64
LAND_SQUARE_FEET                    int64
GROSS_SQUARE_FEET                 float64
YEAR_BUILT                        float64
TAX_CLASS_AT_TIME_OF_SALE           int64
BUILDING_CLASS_AT_TIME_OF_SALE     object
SALE_PRICE                          int64
SALE_DATE                          object
dtype: object

In [300]:
df.head(1)

   BOROUGH NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
44       3        OTHER  ...     550000  01/01/2019

[1 rows x 21 columns]

In [301]:
#splitting the training data off
df['SALE_DATE'] = pd.to_datetime(df['SALE_DATE'])

#ask is between January and March for train
start_date = '01-01-2019'
end_date = '03-31-2019'

mask = (df['SALE_DATE'] > start_date) & (df['SALE_DATE'] <= end_date)

df_train = df.loc[mask]

#verify this worked, grab beginning and end dates of training data
print(df_train.head(1))
print(df_train.tail(1))

   BOROUGH NEIGHBORHOOD  ... SALE_PRICE  SALE_DATE
78       2        OTHER  ...     810000 2019-01-02

[1 rows x 21 columns]
      BOROUGH NEIGHBORHOOD  ... SALE_PRICE  SALE_DATE
18147       4        OTHER  ...     104000 2019-03-30

[1 rows x 21 columns]

In [302]:
df_train.shape

(2515, 21)

In [303]:
#splitting the TEST data off
df['SALE_DATE'] = pd.to_datetime(df['SALE_DATE'])

#ask is between January and March for train
start_date = '04-01-2019'
end_date = '04-30-2019'

mask = (df['SALE_DATE'] > start_date) & (df['SALE_DATE'] <= end_date)

df_test = df.loc[mask]

#verify this worked, grab beginning and end dates of training data
print(df_test.head(1))
print(df_test.tail(1))
print(df_test.shape)

      BOROUGH NEIGHBORHOOD  ... SALE_PRICE  SALE_DATE
18500       2        OTHER  ...     375000 2019-04-02

[1 rows x 21 columns]
      BOROUGH NEIGHBORHOOD  ... SALE_PRICE  SALE_DATE
23035       4        OTHER  ...     510000 2019-04-30

[1 rows x 21 columns]
(606, 21)

In [304]:
#Back to Training Data
#numeric columns on TRAIN
df_train.select_dtypes(include='number').describe().T

                            count           mean  ...       75%        max
BLOCK                      2515.0    6750.895030  ...    9888.5    16350.0
LOT                        2515.0      75.387276  ...      69.5     2720.0
EASE-MENT                     0.0            NaN  ...       NaN        NaN
ZIP_CODE                   2515.0   10993.625447  ...   11413.0    11697.0
RESIDENTIAL_UNITS          2515.0       0.987674  ...       1.0        1.0
COMMERCIAL_UNITS           2515.0       0.016302  ...       0.0        2.0
TOTAL_UNITS                2515.0       1.003976  ...       1.0        3.0
LAND_SQUARE_FEET           2515.0    3144.766600  ...    4000.0    18906.0
GROSS_SQUARE_FEET          2515.0    1473.349901  ...    1683.0     7875.0
YEAR_BUILT                 2515.0    1944.737575  ...    1960.0     2018.0
TAX_CLASS_AT_TIME_OF_SALE  2515.0       1.000000  ...       1.0        1.0
SALE_PRICE                 2515.0  621206.907356  ...  750000.0  2000000.0

[12 rows x 8 columns]

In [305]:
#non-numeric columns
df_train.select_dtypes(exclude='number').describe().T

                               count unique  ...      first       last
BOROUGH                         2515      5  ...        NaT        NaT
NEIGHBORHOOD                    2515      7  ...        NaT        NaT
BUILDING_CLASS_CATEGORY         2515      1  ...        NaT        NaT
TAX_CLASS_AT_PRESENT            2515      2  ...        NaT        NaT
BUILDING_CLASS_AT_PRESENT       2515     13  ...        NaT        NaT
ADDRESS                         2515   2505  ...        NaT        NaT
APARTMENT_NUMBER                   1      1  ...        NaT        NaT
BUILDING_CLASS_AT_TIME_OF_SALE  2515     11  ...        NaT        NaT
SALE_DATE                       2515     67  ... 2019-01-02 2019-03-30

[9 rows x 6 columns]

In [0]:
#lets drop addresses, cardinality is too high
target = 'SALE_PRICE'
high_cardinality = ['ADDRESS']
features = df_train.columns.drop([target] + high_cardinality)

x_train = df_train[features]
y_train = df_train[target]
x_test = df_test[features]
y_test = df_test[target]

In [307]:
#check train
df_train.select_dtypes(exclude='number').describe().T

                               count unique  ...      first       last
BOROUGH                         2515      5  ...        NaT        NaT
NEIGHBORHOOD                    2515      7  ...        NaT        NaT
BUILDING_CLASS_CATEGORY         2515      1  ...        NaT        NaT
TAX_CLASS_AT_PRESENT            2515      2  ...        NaT        NaT
BUILDING_CLASS_AT_PRESENT       2515     13  ...        NaT        NaT
ADDRESS                         2515   2505  ...        NaT        NaT
APARTMENT_NUMBER                   1      1  ...        NaT        NaT
BUILDING_CLASS_AT_TIME_OF_SALE  2515     11  ...        NaT        NaT
SALE_DATE                       2515     67  ... 2019-01-02 2019-03-30

[9 rows x 6 columns]

In [308]:
#check test
df_test.select_dtypes(exclude='number').describe().T

                               count unique  ...      first       last
BOROUGH                          606      5  ...        NaT        NaT
NEIGHBORHOOD                     606      7  ...        NaT        NaT
BUILDING_CLASS_CATEGORY          606      1  ...        NaT        NaT
TAX_CLASS_AT_PRESENT             606      2  ...        NaT        NaT
BUILDING_CLASS_AT_PRESENT        606     10  ...        NaT        NaT
ADDRESS                          606    605  ...        NaT        NaT
APARTMENT_NUMBER                   0      0  ...        NaT        NaT
BUILDING_CLASS_AT_TIME_OF_SALE   606     10  ...        NaT        NaT
SALE_DATE                        606     22  ... 2019-04-02 2019-04-30

[9 rows x 6 columns]

In [309]:
!pip install category_encoders

Requirement already satisfied: category_encoders in /usr/local/lib/python3.6/dist-packages (2.1.0)
Requirement already satisfied: scipy>=0.19.0 in /usr/local/lib/python3.6/dist-packages (from category_encoders) (1.3.1)
Requirement already satisfied: pandas>=0.21.1 in /usr/local/lib/python3.6/dist-packages (from category_encoders) (0.25.3)
Requirement already satisfied: numpy>=1.11.3 in /usr/local/lib/python3.6/dist-packages (from category_encoders) (1.17.3)
Requirement already satisfied: patsy>=0.4.1 in /usr/local/lib/python3.6/dist-packages (from category_encoders) (0.5.1)
Requirement already satisfied: statsmodels>=0.6.1 in /usr/local/lib/python3.6/dist-packages (from category_encoders) (0.10.1)
Requirement already satisfied: scikit-learn>=0.20.0 in /usr/local/lib/python3.6/dist-packages (from category_encoders) (0.21.3)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.21.1->category_encoders) (2.6.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.21.1->category_encoders) (2018.9)
Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from patsy>=0.4.1->category_encoders) (1.12.0)
Requirement already satisfied: joblib>=0.11 in /usr/local/lib/python3.6/dist-packages (from scikit-learn>=0.20.0->category_encoders) (0.14.0)

In [310]:
#do one hot encoding of categorical features
import category_encoders as ce 
encoder = ce.OneHotEncoder(use_cat_names=True)
df_train = encoder.fit_transform(df_train)
df_test = encoder.transform(df_test)
df_train.head()

     BOROUGH_2  BOROUGH_3  ...  SALE_PRICE  SALE_DATE
78           1          0  ...      810000 2019-01-02
108          0          1  ...      125000 2019-01-02
111          0          1  ...      620000 2019-01-02
120          0          1  ...     1150000 2019-01-02
121          0          1  ...      836500 2019-01-02

[5 rows x 2559 columns]

In [311]:
df_train.shape

(2515, 2559)

In [312]:
df_test.shape

(606, 2559)

In [313]:
#feature selection, picking the top 15
from sklearn.feature_selection import f_regression, SelectKBest
selector = SelectKBest(score_func = f_regression, k=15)
x_train_selected = selector.fit_transform(x_train, y_train)
x_test_selected = selector.transform(x_test)

x_train_selected.shape

ValueError: ignored

In [0]:
#Ridge
#Ridge and Lasso regression are some of the simple techniques 
#to reduce model complexity and prevent over-fitting which may 
#result from simple linear regression.

#So, ridge regression shrinks the coefficients 
#and it helps to reduce the model complexity and multi-collinearity.

#So the lower the constraint (low Î») on the features, 
#the model will resemble linear regression model.

In [0]:
#5 steps
import pandas as pd
#Step 1 - importing the appropriate estimator, in this case, Linear Regression
from sklearn.linear_model import Ridge

#choosing model hyperparamaters by instantiating class with "model" in this case
model = Ridge()

#Arranging into features matrix and target matrix. 
features = ['YEAR_BUILT']
target = ['SALE_PRICE']
x=df_train[features]
y=df_train[target]

#check
#print(x.shape, y.shape)

#fit the model to the data..
model.fit(x,y)

In [0]:
import matplotlib.pyplot as plt
import numpy as np 
import pandas as pd
import matplotlib

#SKlearn
#from sklearn.cross_validation import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import Ridge